l1d000/AliOS-Things/platform/mcu/bk7231u/beken/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_ripple.h
__INLINE uint32_t rpl_seqrxdn_out1_get(void)
{
    return REG_RPL_RD(RPL_SEQRXDN_OUT1_ADDR);
}

__INLINE void rpl_seqrxdn_out1_set(uint32_t value)
{
    REG_RPL_WR(RPL_SEQRXDN_OUT1_ADDR, value);
}

// field definitions
#define RPL_RX_DN_OUT5_MASK   ((uint32_t)0x7FC00000)
#define RPL_RX_DN_OUT5_LSB    22
#define RPL_RX_DN_OUT5_WIDTH  ((uint32_t)0x00000009)
#define RPL_RX_DN_OUT4_MASK   ((uint32_t)0x000FF800)
#define RPL_RX_DN_OUT4_LSB    11
#define RPL_RX_DN_OUT4_WIDTH  ((uint32_t)0x00000009)
#define RPL_RX_DN_OUT3_MASK   ((uint32_t)0x000001FF)
#define RPL_RX_DN_OUT3_LSB    0
#define RPL_RX_DN_OUT3_WIDTH  ((uint32_t)0x00000009)

#define RPL_RX_DN_OUT5_RST    0x0
#define RPL_RX_DN_OUT4_RST    0x0
#define RPL_RX_DN_OUT3_RST    0x1

__INLINE void rpl_seqrxdn_out1_pack(uint16_t rxdnout5, uint16_t rxdnout4, uint16_t rxdnout3)
{
    ASSERT_ERR((((uint32_t)rxdnout5 << 22) & ~((uint32_t)0x7FC00000)) == 0);
    ASSERT_ERR((((uint32_t)rxdnout4 << 11) & ~((uint32_t)0x000FF800)) == 0);
    ASSERT_ERR((((uint32_t)rxdnout3 << 0) & ~((uint32_t)0x000001FF)) == 0);
    REG_RPL_WR(RPL_SEQRXDN_OUT1_ADDR,  ((uint32_t)rxdnout5 << 22) | ((uint32_t)rxdnout4 << 11) | ((uint32_t)rxdnout3 << 0));
}

__INLINE void rpl_seqrxdn_out1_unpack(uint16_t* rxdnout5, uint16_t* rxdnout4, uint16_t* rxdnout3)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQRXDN_OUT1_ADDR);

    *rxdnout5 = (localVal & ((uint32_t)0x7FC00000)) >> 22;
    *rxdnout4 = (localVal & ((uint32_t)0x000FF800)) >> 11;
    *rxdnout3 = (localVal & ((uint32_t)0x000001FF)) >> 0;
}

__INLINE uint16_t rpl_rx_dn_out5_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQRXDN_OUT1_ADDR);
    return ((localVal & ((uint32_t)0x7FC00000)) >> 22);
}

__INLINE void rpl_rx_dn_out5_setf(uint16_t rxdnout5)
{
    ASSERT_ERR((((uint32_t)rxdnout5 << 22) & ~((uint32_t)0x7FC00000)) == 0);
    REG_RPL_WR(RPL_SEQRXDN_OUT1_ADDR, (REG_RPL_RD(RPL_SEQRXDN_OUT1_ADDR) & ~((uint32_t)0x7FC00000)) | ((uint32_t)rxdnout5 << 22));
}

__INLINE uint16_t rpl_rx_dn_out4_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQRXDN_OUT1_ADDR);
    return ((localVal & ((uint32_t)0x000FF800)) >> 11);
}

__INLINE void rpl_rx_dn_out4_setf(uint16_t rxdnout4)
{
    ASSERT_ERR((((uint32_t)rxdnout4 << 11) & ~((uint32_t)0x000FF800)) == 0);
    REG_RPL_WR(RPL_SEQRXDN_OUT1_ADDR, (REG_RPL_RD(RPL_SEQRXDN_OUT1_ADDR) & ~((uint32_t)0x000FF800)) | ((uint32_t)rxdnout4 << 11));
}

__INLINE uint16_t rpl_rx_dn_out3_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQRXDN_OUT1_ADDR);
    return ((localVal & ((uint32_t)0x000001FF)) >> 0);
}

__INLINE void rpl_rx_dn_out3_setf(uint16_t rxdnout3)
{
    ASSERT_ERR((((uint32_t)rxdnout3 << 0) & ~((uint32_t)0x000001FF)) == 0);
    REG_RPL_WR(RPL_SEQRXDN_OUT1_ADDR, (REG_RPL_RD(RPL_SEQRXDN_OUT1_ADDR) & ~((uint32_t)0x000001FF)) | ((uint32_t)rxdnout3 << 0));
}

/**
 * @brief SEQRXDN_OUT2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  30:22           RX_DN_OUT8   0x0
 *  19:11           RX_DN_OUT7   0x0
 *  08:00           RX_DN_OUT6   0x0
 * </pre>
 */
#define RPL_SEQRXDN_OUT2_ADDR   0x0000001A
#define RPL_SEQRXDN_OUT2_OFFSET 0x0000001A
#define RPL_SEQRXDN_OUT2_INDEX  0x0000001A
#define RPL_SEQRXDN_OUT2_RESET  0x00000000

__INLINE uint32_t rpl_seqrxdn_out2_get(void)
{
    return REG_RPL_RD(RPL_SEQRXDN_OUT2_ADDR);
}

__INLINE void rpl_seqrxdn_out2_set(uint32_t value)
{
    REG_RPL_WR(RPL_SEQRXDN_OUT2_ADDR, value);
}

// field definitions
#define RPL_RX_DN_OUT8_MASK   ((uint32_t)0x7FC00000)
#define RPL_RX_DN_OUT8_LSB    22
#define RPL_RX_DN_OUT8_WIDTH  ((uint32_t)0x00000009)
#define RPL_RX_DN_OUT7_MASK   ((uint32_t)0x000FF800)
#define RPL_RX_DN_OUT7_LSB    11
#define RPL_RX_DN_OUT7_WIDTH  ((uint32_t)0x00000009)
#define RPL_RX_DN_OUT6_MASK   ((uint32_t)0x000001FF)
#define RPL_RX_DN_OUT6_LSB    0
#define RPL_RX_DN_OUT6_WIDTH  ((uint32_t)0x00000009)

#define RPL_RX_DN_OUT8_RST    0x0
#define RPL_RX_DN_OUT7_RST    0x0
#define RPL_RX_DN_OUT6_RST    0x0

__INLINE void rpl_seqrxdn_out2_pack(uint16_t rxdnout8, uint16_t rxdnout7, uint16_t rxdnout6)
{
    ASSERT_ERR((((uint32_t)rxdnout8 << 22) & ~((uint32_t)0x7FC00000)) == 0);
    ASSERT_ERR((((uint32_t)rxdnout7 << 11) & ~((uint32_t)0x000FF800)) == 0);
    ASSERT_ERR((((uint32_t)rxdnout6 << 0) & ~((uint32_t)0x000001FF)) == 0);
    REG_RPL_WR(RPL_SEQRXDN_OUT2_ADDR,  ((uint32_t)rxdnout8 << 22) | ((uint32_t)rxdnout7 << 11) | ((uint32_t)rxdnout6 << 0));
}

__INLINE void rpl_seqrxdn_out2_unpack(uint16_t* rxdnout8, uint16_t* rxdnout7, uint16_t* rxdnout6)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQRXDN_OUT2_ADDR);

    *rxdnout8 = (localVal & ((uint32_t)0x7FC00000)) >> 22;
    *rxdnout7 = (localVal & ((uint32_t)0x000FF800)) >> 11;
    *rxdnout6 = (localVal & ((uint32_t)0x000001FF)) >> 0;
}

__INLINE uint16_t rpl_rx_dn_out8_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQRXDN_OUT2_ADDR);
    return ((localVal & ((uint32_t)0x7FC00000)) >> 22);
}

__INLINE void rpl_rx_dn_out8_setf(uint16_t rxdnout8)
{
    ASSERT_ERR((((uint32_t)rxdnout8 << 22) & ~((uint32_t)0x7FC00000)) == 0);
    REG_RPL_WR(RPL_SEQRXDN_OUT2_ADDR, (REG_RPL_RD(RPL_SEQRXDN_OUT2_ADDR) & ~((uint32_t)0x7FC00000)) | ((uint32_t)rxdnout8 << 22));
}

__INLINE uint16_t rpl_rx_dn_out7_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQRXDN_OUT2_ADDR);
    return ((localVal & ((uint32_t)0x000FF800)) >> 11);
}

__INLINE void rpl_rx_dn_out7_setf(uint16_t rxdnout7)
{
    ASSERT_ERR((((uint32_t)rxdnout7 << 11) & ~((uint32_t)0x000FF800)) == 0);
    REG_RPL_WR(RPL_SEQRXDN_OUT2_ADDR, (REG_RPL_RD(RPL_SEQRXDN_OUT2_ADDR) & ~((uint32_t)0x000FF800)) | ((uint32_t)rxdnout7 << 11));
}

__INLINE uint16_t rpl_rx_dn_out6_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_SEQRXDN_OUT2_ADDR);
    return ((localVal & ((uint32_t)0x000001FF)) >> 0);
}

__INLINE void rpl_rx_dn_out6_setf(uint16_t rxdnout6)
{
    ASSERT_ERR((((uint32_t)rxdnout6 << 0) & ~((uint32_t)0x000001FF)) == 0);
    REG_RPL_WR(RPL_SEQRXDN_OUT2_ADDR, (REG_RPL_RD(RPL_SEQRXDN_OUT2_ADDR) & ~((uint32_t)0x000001FF)) | ((uint32_t)rxdnout6 << 0));
}

/**
 * @brief RFSWCNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     12           TESTMUX_EN   0
 *  09:08         SEL_INPUTBUF   0x0
 *  06:04           SEL_RFSW32   0x0
 *  02:00           SEL_RFSW10   0x0
 * </pre>
 */
#define RPL_RFSWCNTL_ADDR   0x0000001B
#define RPL_RFSWCNTL_OFFSET 0x0000001B
#define RPL_RFSWCNTL_INDEX  0x0000001B
#define RPL_RFSWCNTL_RESET  0x00000000

__INLINE uint32_t rpl_rfswcntl_get(void)
{
    return REG_RPL_RD(RPL_RFSWCNTL_ADDR);
}

__INLINE void rpl_rfswcntl_set(uint32_t value)
{
    REG_RPL_WR(RPL_RFSWCNTL_ADDR, value);
}

