l1d000/AliOS-Things/platform/mcu/bk7231u/beken/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_ripple.h
__INLINE void rpl_rpllsdcntl2_unpack(uint8_t* btledumoen, uint8_t* btlefilterscaling, uint8_t* filterscaling, uint8_t* fmtx2pen, uint8_t* fmtxen, uint8_t* sdditheren, uint8_t* rpllsdorder, uint8_t* rpllfracen)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLSDCNTL2_ADDR);

    *btledumoen = (localVal & ((uint32_t)0x80000000)) >> 31;
    *btlefilterscaling = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *filterscaling = (localVal & ((uint32_t)0x0000FF00)) >> 8;
    *fmtx2pen = (localVal & ((uint32_t)0x00000020)) >> 5;
    *fmtxen = (localVal & ((uint32_t)0x00000010)) >> 4;
    *sdditheren = (localVal & ((uint32_t)0x00000008)) >> 3;
    *rpllsdorder = (localVal & ((uint32_t)0x00000006)) >> 1;
    *rpllfracen = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t rpl_btle_dumo_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLSDCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__INLINE void rpl_btle_dumo_en_setf(uint8_t btledumoen)
{
    ASSERT_ERR((((uint32_t)btledumoen << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_RPL_WR(RPL_RPLLSDCNTL2_ADDR, (REG_RPL_RD(RPL_RPLLSDCNTL2_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)btledumoen << 31));
}

__INLINE uint8_t rpl_btle_filter_scaling_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLSDCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

__INLINE void rpl_btle_filter_scaling_setf(uint8_t btlefilterscaling)
{
    ASSERT_ERR((((uint32_t)btlefilterscaling << 16) & ~((uint32_t)0x00FF0000)) == 0);
    REG_RPL_WR(RPL_RPLLSDCNTL2_ADDR, (REG_RPL_RD(RPL_RPLLSDCNTL2_ADDR) & ~((uint32_t)0x00FF0000)) | ((uint32_t)btlefilterscaling << 16));
}

__INLINE uint8_t rpl_filter_scaling_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLSDCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

__INLINE void rpl_filter_scaling_setf(uint8_t filterscaling)
{
    ASSERT_ERR((((uint32_t)filterscaling << 8) & ~((uint32_t)0x0000FF00)) == 0);
    REG_RPL_WR(RPL_RPLLSDCNTL2_ADDR, (REG_RPL_RD(RPL_RPLLSDCNTL2_ADDR) & ~((uint32_t)0x0000FF00)) | ((uint32_t)filterscaling << 8));
}

__INLINE uint8_t rpl_fmtx2p_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLSDCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00000020)) >> 5);
}

__INLINE void rpl_fmtx2p_en_setf(uint8_t fmtx2pen)
{
    ASSERT_ERR((((uint32_t)fmtx2pen << 5) & ~((uint32_t)0x00000020)) == 0);
    REG_RPL_WR(RPL_RPLLSDCNTL2_ADDR, (REG_RPL_RD(RPL_RPLLSDCNTL2_ADDR) & ~((uint32_t)0x00000020)) | ((uint32_t)fmtx2pen << 5));
}

__INLINE uint8_t rpl_fmtx_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLSDCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__INLINE void rpl_fmtx_en_setf(uint8_t fmtxen)
{
    ASSERT_ERR((((uint32_t)fmtxen << 4) & ~((uint32_t)0x00000010)) == 0);
    REG_RPL_WR(RPL_RPLLSDCNTL2_ADDR, (REG_RPL_RD(RPL_RPLLSDCNTL2_ADDR) & ~((uint32_t)0x00000010)) | ((uint32_t)fmtxen << 4));
}

__INLINE uint8_t rpl_sddither_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLSDCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__INLINE void rpl_sddither_en_setf(uint8_t sdditheren)
{
    ASSERT_ERR((((uint32_t)sdditheren << 3) & ~((uint32_t)0x00000008)) == 0);
    REG_RPL_WR(RPL_RPLLSDCNTL2_ADDR, (REG_RPL_RD(RPL_RPLLSDCNTL2_ADDR) & ~((uint32_t)0x00000008)) | ((uint32_t)sdditheren << 3));
}

__INLINE uint8_t rpl_rpll_sdorder_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLSDCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00000006)) >> 1);
}

__INLINE void rpl_rpll_sdorder_setf(uint8_t rpllsdorder)
{
    ASSERT_ERR((((uint32_t)rpllsdorder << 1) & ~((uint32_t)0x00000006)) == 0);
    REG_RPL_WR(RPL_RPLLSDCNTL2_ADDR, (REG_RPL_RD(RPL_RPLLSDCNTL2_ADDR) & ~((uint32_t)0x00000006)) | ((uint32_t)rpllsdorder << 1));
}

__INLINE uint8_t rpl_rpll_frac_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLSDCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__INLINE void rpl_rpll_frac_en_setf(uint8_t rpllfracen)
{
    ASSERT_ERR((((uint32_t)rpllfracen << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(RPL_RPLLSDCNTL2_ADDR, (REG_RPL_RD(RPL_RPLLSDCNTL2_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)rpllfracen << 0));
}

/**
 * @brief RPLLSDSTAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:08          RPLL_NFRACT   0x0
 *  07:00            RPLL_NINT   0x0
 * </pre>
 */
#define RPL_RPLLSDSTAT_ADDR   0x00000023
#define RPL_RPLLSDSTAT_OFFSET 0x00000023
#define RPL_RPLLSDSTAT_INDEX  0x00000023
#define RPL_RPLLSDSTAT_RESET  0x00000000

__INLINE uint32_t rpl_rpllsdstat_get(void)
{
    return REG_RPL_RD(RPL_RPLLSDSTAT_ADDR);
}

// field definitions
#define RPL_RPLL_NFRACT_MASK   ((uint32_t)0xFFFFFF00)
#define RPL_RPLL_NFRACT_LSB    8
#define RPL_RPLL_NFRACT_WIDTH  ((uint32_t)0x00000018)
#define RPL_RPLL_NINT_MASK     ((uint32_t)0x000000FF)
#define RPL_RPLL_NINT_LSB      0
#define RPL_RPLL_NINT_WIDTH    ((uint32_t)0x00000008)

#define RPL_RPLL_NFRACT_RST    0x0
#define RPL_RPLL_NINT_RST      0x0

__INLINE void rpl_rpllsdstat_unpack(uint32_t* rpllnfract, uint8_t* rpllnint)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLSDSTAT_ADDR);

    *rpllnfract = (localVal & ((uint32_t)0xFFFFFF00)) >> 8;
    *rpllnint = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint32_t rpl_rpll_nfract_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLSDSTAT_ADDR);
    return ((localVal & ((uint32_t)0xFFFFFF00)) >> 8);
}

__INLINE uint8_t rpl_rpll_nint_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RPLLSDSTAT_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

/**
 * @brief RPLLMASH_INIT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:24            MASH_SDI4   0xD
 *  23:16            MASH_SDI3   0xB
 *  15:08            MASH_SDI2   0x13
 *  07:00            MASH_SDI1   0x11
 * </pre>
 */
#define RPL_RPLLMASH_INIT_ADDR   0x00000024
#define RPL_RPLLMASH_INIT_OFFSET 0x00000024
#define RPL_RPLLMASH_INIT_INDEX  0x00000024
#define RPL_RPLLMASH_INIT_RESET  0x0D0B1311

__INLINE uint32_t rpl_rpllmash_init_get(void)
{
    return REG_RPL_RD(RPL_RPLLMASH_INIT_ADDR);
}

__INLINE void rpl_rpllmash_init_set(uint32_t value)
{
    REG_RPL_WR(RPL_RPLLMASH_INIT_ADDR, value);
}

