l1d000/AliOS-Things/platform/mcu/bk7231u/beken/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_ripple.h
#define RPL_FORCE_DPLL_CTRL_RST    0x0
#define RPL_DPLL_LD_ON_RST         0x0
#define RPL_DPLL_VCOMMON_ON_RST        0x0
#define RPL_DPLL_CP_ON_RST         0x0

__INLINE void rpl_dpllcntl0_pack(uint8_t forcedpllctrl, uint8_t dpllldon, uint8_t dpllvcoon, uint8_t dpllcpon)
{
    ASSERT_ERR((((uint32_t)forcedpllctrl << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)dpllldon << 3) & ~((uint32_t)0x00000008)) == 0);
    ASSERT_ERR((((uint32_t)dpllvcoon << 2) & ~((uint32_t)0x00000004)) == 0);
    ASSERT_ERR((((uint32_t)dpllcpon << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL0_ADDR,  ((uint32_t)forcedpllctrl << 31) | ((uint32_t)dpllldon << 3) | ((uint32_t)dpllvcoon << 2) | ((uint32_t)dpllcpon << 1));
}

__INLINE void rpl_dpllcntl0_unpack(uint8_t* forcedpllctrl, uint8_t* dpllldon, uint8_t* dpllvcoon, uint8_t* dpllcpon)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL0_ADDR);

    *forcedpllctrl = (localVal & ((uint32_t)0x80000000)) >> 31;
    *dpllldon = (localVal & ((uint32_t)0x00000008)) >> 3;
    *dpllvcoon = (localVal & ((uint32_t)0x00000004)) >> 2;
    *dpllcpon = (localVal & ((uint32_t)0x00000002)) >> 1;
}

__INLINE uint8_t rpl_force_dpll_ctrl_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__INLINE void rpl_force_dpll_ctrl_setf(uint8_t forcedpllctrl)
{
    ASSERT_ERR((((uint32_t)forcedpllctrl << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL0_ADDR, (REG_RPL_RD(RPL_DPLLCNTL0_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)forcedpllctrl << 31));
}

__INLINE uint8_t rpl_dpll_ld_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__INLINE void rpl_dpll_ld_on_setf(uint8_t dpllldon)
{
    ASSERT_ERR((((uint32_t)dpllldon << 3) & ~((uint32_t)0x00000008)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL0_ADDR, (REG_RPL_RD(RPL_DPLLCNTL0_ADDR) & ~((uint32_t)0x00000008)) | ((uint32_t)dpllldon << 3));
}

__INLINE uint8_t rpl_dpll_vcommon_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__INLINE void rpl_dpll_vcommon_on_setf(uint8_t dpllvcoon)
{
    ASSERT_ERR((((uint32_t)dpllvcoon << 2) & ~((uint32_t)0x00000004)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL0_ADDR, (REG_RPL_RD(RPL_DPLLCNTL0_ADDR) & ~((uint32_t)0x00000004)) | ((uint32_t)dpllvcoon << 2));
}

__INLINE uint8_t rpl_dpll_cp_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE void rpl_dpll_cp_on_setf(uint8_t dpllcpon)
{
    ASSERT_ERR((((uint32_t)dpllcpon << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL0_ADDR, (REG_RPL_RD(RPL_DPLLCNTL0_ADDR) & ~((uint32_t)0x00000002)) | ((uint32_t)dpllcpon << 1));
}

/**
 * @brief DPLLCNTL1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  29:28            DPLL_DIVR   0x0
 *  26:24            DPLL_DIVP   0x0
 *  23:08          DPLL_NFRACT   0x0
 *  04:00            DPLL_NINT   0x0
 * </pre>
 */
#define RPL_DPLLCNTL1_ADDR   0x00000033
#define RPL_DPLLCNTL1_OFFSET 0x00000033
#define RPL_DPLLCNTL1_INDEX  0x00000033
#define RPL_DPLLCNTL1_RESET  0x00000000

__INLINE uint32_t rpl_dpllcntl1_get(void)
{
    return REG_RPL_RD(RPL_DPLLCNTL1_ADDR);
}

__INLINE void rpl_dpllcntl1_set(uint32_t value)
{
    REG_RPL_WR(RPL_DPLLCNTL1_ADDR, value);
}

// field definitions
#define RPL_DPLL_DIVR_MASK     ((uint32_t)0x30000000)
#define RPL_DPLL_DIVR_LSB      28
#define RPL_DPLL_DIVR_WIDTH    ((uint32_t)0x00000002)
#define RPL_DPLL_DIVP_MASK     ((uint32_t)0x07000000)
#define RPL_DPLL_DIVP_LSB      24
#define RPL_DPLL_DIVP_WIDTH    ((uint32_t)0x00000003)
#define RPL_DPLL_NFRACT_MASK   ((uint32_t)0x00FFFF00)
#define RPL_DPLL_NFRACT_LSB    8
#define RPL_DPLL_NFRACT_WIDTH  ((uint32_t)0x00000010)
#define RPL_DPLL_NINT_MASK     ((uint32_t)0x0000001F)
#define RPL_DPLL_NINT_LSB      0
#define RPL_DPLL_NINT_WIDTH    ((uint32_t)0x00000005)

#define RPL_DPLL_DIVR_RST      0x0
#define RPL_DPLL_DIVP_RST      0x0
#define RPL_DPLL_NFRACT_RST    0x0
#define RPL_DPLL_NINT_RST      0x0

__INLINE void rpl_dpllcntl1_pack(uint8_t dplldivr, uint8_t dplldivp, uint16_t dpllnfract, uint8_t dpllnint)
{
    ASSERT_ERR((((uint32_t)dplldivr << 28) & ~((uint32_t)0x30000000)) == 0);
    ASSERT_ERR((((uint32_t)dplldivp << 24) & ~((uint32_t)0x07000000)) == 0);
    ASSERT_ERR((((uint32_t)dpllnfract << 8) & ~((uint32_t)0x00FFFF00)) == 0);
    ASSERT_ERR((((uint32_t)dpllnint << 0) & ~((uint32_t)0x0000001F)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL1_ADDR,  ((uint32_t)dplldivr << 28) | ((uint32_t)dplldivp << 24) | ((uint32_t)dpllnfract << 8) | ((uint32_t)dpllnint << 0));
}

__INLINE void rpl_dpllcntl1_unpack(uint8_t* dplldivr, uint8_t* dplldivp, uint16_t* dpllnfract, uint8_t* dpllnint)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL1_ADDR);

    *dplldivr = (localVal & ((uint32_t)0x30000000)) >> 28;
    *dplldivp = (localVal & ((uint32_t)0x07000000)) >> 24;
    *dpllnfract = (localVal & ((uint32_t)0x00FFFF00)) >> 8;
    *dpllnint = (localVal & ((uint32_t)0x0000001F)) >> 0;
}

__INLINE uint8_t rpl_dpll_divr_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x30000000)) >> 28);
}

__INLINE void rpl_dpll_divr_setf(uint8_t dplldivr)
{
    ASSERT_ERR((((uint32_t)dplldivr << 28) & ~((uint32_t)0x30000000)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL1_ADDR, (REG_RPL_RD(RPL_DPLLCNTL1_ADDR) & ~((uint32_t)0x30000000)) | ((uint32_t)dplldivr << 28));
}

__INLINE uint8_t rpl_dpll_divp_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x07000000)) >> 24);
}

__INLINE void rpl_dpll_divp_setf(uint8_t dplldivp)
{
    ASSERT_ERR((((uint32_t)dplldivp << 24) & ~((uint32_t)0x07000000)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL1_ADDR, (REG_RPL_RD(RPL_DPLLCNTL1_ADDR) & ~((uint32_t)0x07000000)) | ((uint32_t)dplldivp << 24));
}

__INLINE uint16_t rpl_dpll_nfract_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00FFFF00)) >> 8);
}

__INLINE void rpl_dpll_nfract_setf(uint16_t dpllnfract)
{
    ASSERT_ERR((((uint32_t)dpllnfract << 8) & ~((uint32_t)0x00FFFF00)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL1_ADDR, (REG_RPL_RD(RPL_DPLLCNTL1_ADDR) & ~((uint32_t)0x00FFFF00)) | ((uint32_t)dpllnfract << 8));
}

__INLINE uint8_t rpl_dpll_nint_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x0000001F)) >> 0);
}

__INLINE void rpl_dpll_nint_setf(uint8_t dpllnint)
{
    ASSERT_ERR((((uint32_t)dpllnint << 0) & ~((uint32_t)0x0000001F)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL1_ADDR, (REG_RPL_RD(RPL_DPLLCNTL1_ADDR) & ~((uint32_t)0x0000001F)) | ((uint32_t)dpllnint << 0));
}

/**
 * @brief DPLLCNTL2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  17:16         DPLL_SDORDER   0x1
 *  14:12      DPLL_ICP_OFFSET   0x0
 *     11         DPLL_VCOMMON_CFG   0
 *  10:08         DPLL_PFD_CFG   0x0
 *  07:04             DPLL_ICP   0x0
 *     03         DPLL_TEST_EN   0
 *     02   DPLL_VCOMMON_SPEEDUP_EN   0
 *     01        DPLL_FRACT_EN   0
 *     00          DPLL_DTP_EN   0
 * </pre>
 */
#define RPL_DPLLCNTL2_ADDR   0x00000034
#define RPL_DPLLCNTL2_OFFSET 0x00000034
#define RPL_DPLLCNTL2_INDEX  0x00000034
#define RPL_DPLLCNTL2_RESET  0x00010000

