l1d000/AliOS-Things/platform/mcu/bk7231u/beken/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_ripple.h
__INLINE uint32_t rpl_dpllcntl2_get(void)
{
    return REG_RPL_RD(RPL_DPLLCNTL2_ADDR);
}

__INLINE void rpl_dpllcntl2_set(uint32_t value)
{
    REG_RPL_WR(RPL_DPLLCNTL2_ADDR, value);
}

// field definitions
#define RPL_DPLL_SDORDER_MASK          ((uint32_t)0x00030000)
#define RPL_DPLL_SDORDER_LSB           16
#define RPL_DPLL_SDORDER_WIDTH         ((uint32_t)0x00000002)
#define RPL_DPLL_ICP_OFFSET_MASK       ((uint32_t)0x00007000)
#define RPL_DPLL_ICP_OFFSET_LSB        12
#define RPL_DPLL_ICP_OFFSET_WIDTH      ((uint32_t)0x00000003)
#define RPL_DPLL_VCOMMON_CFG_BIT           ((uint32_t)0x00000800)
#define RPL_DPLL_VCOMMON_CFG_POS           11
#define RPL_DPLL_PFD_CFG_MASK          ((uint32_t)0x00000700)
#define RPL_DPLL_PFD_CFG_LSB           8
#define RPL_DPLL_PFD_CFG_WIDTH         ((uint32_t)0x00000003)
#define RPL_DPLL_ICP_MASK              ((uint32_t)0x000000F0)
#define RPL_DPLL_ICP_LSB               4
#define RPL_DPLL_ICP_WIDTH             ((uint32_t)0x00000004)
#define RPL_DPLL_TEST_EN_BIT           ((uint32_t)0x00000008)
#define RPL_DPLL_TEST_EN_POS           3
#define RPL_DPLL_VCOMMON_SPEEDUP_EN_BIT    ((uint32_t)0x00000004)
#define RPL_DPLL_VCOMMON_SPEEDUP_EN_POS    2
#define RPL_DPLL_FRACT_EN_BIT          ((uint32_t)0x00000002)
#define RPL_DPLL_FRACT_EN_POS          1
#define RPL_DPLL_DTP_EN_BIT            ((uint32_t)0x00000001)
#define RPL_DPLL_DTP_EN_POS            0

#define RPL_DPLL_SDORDER_RST           0x1
#define RPL_DPLL_ICP_OFFSET_RST        0x0
#define RPL_DPLL_VCOMMON_CFG_RST           0x0
#define RPL_DPLL_PFD_CFG_RST           0x0
#define RPL_DPLL_ICP_RST               0x0
#define RPL_DPLL_TEST_EN_RST           0x0
#define RPL_DPLL_VCOMMON_SPEEDUP_EN_RST    0x0
#define RPL_DPLL_FRACT_EN_RST          0x0
#define RPL_DPLL_DTP_EN_RST            0x0

__INLINE void rpl_dpllcntl2_pack(uint8_t dpllsdorder, uint8_t dpllicpoffset, uint8_t dpllvcocfg, uint8_t dpllpfdcfg, uint8_t dpllicp, uint8_t dplltesten, uint8_t dpllvcospeedupen, uint8_t dpllfracten, uint8_t dplldtpen)
{
    ASSERT_ERR((((uint32_t)dpllsdorder << 16) & ~((uint32_t)0x00030000)) == 0);
    ASSERT_ERR((((uint32_t)dpllicpoffset << 12) & ~((uint32_t)0x00007000)) == 0);
    ASSERT_ERR((((uint32_t)dpllvcocfg << 11) & ~((uint32_t)0x00000800)) == 0);
    ASSERT_ERR((((uint32_t)dpllpfdcfg << 8) & ~((uint32_t)0x00000700)) == 0);
    ASSERT_ERR((((uint32_t)dpllicp << 4) & ~((uint32_t)0x000000F0)) == 0);
    ASSERT_ERR((((uint32_t)dplltesten << 3) & ~((uint32_t)0x00000008)) == 0);
    ASSERT_ERR((((uint32_t)dpllvcospeedupen << 2) & ~((uint32_t)0x00000004)) == 0);
    ASSERT_ERR((((uint32_t)dpllfracten << 1) & ~((uint32_t)0x00000002)) == 0);
    ASSERT_ERR((((uint32_t)dplldtpen << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL2_ADDR,  ((uint32_t)dpllsdorder << 16) | ((uint32_t)dpllicpoffset << 12) | ((uint32_t)dpllvcocfg << 11) | ((uint32_t)dpllpfdcfg << 8) | ((uint32_t)dpllicp << 4) | ((uint32_t)dplltesten << 3) | ((uint32_t)dpllvcospeedupen << 2) | ((uint32_t)dpllfracten << 1) | ((uint32_t)dplldtpen << 0));
}

__INLINE void rpl_dpllcntl2_unpack(uint8_t* dpllsdorder, uint8_t* dpllicpoffset, uint8_t* dpllvcocfg, uint8_t* dpllpfdcfg, uint8_t* dpllicp, uint8_t* dplltesten, uint8_t* dpllvcospeedupen, uint8_t* dpllfracten, uint8_t* dplldtpen)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL2_ADDR);

    *dpllsdorder = (localVal & ((uint32_t)0x00030000)) >> 16;
    *dpllicpoffset = (localVal & ((uint32_t)0x00007000)) >> 12;
    *dpllvcocfg = (localVal & ((uint32_t)0x00000800)) >> 11;
    *dpllpfdcfg = (localVal & ((uint32_t)0x00000700)) >> 8;
    *dpllicp = (localVal & ((uint32_t)0x000000F0)) >> 4;
    *dplltesten = (localVal & ((uint32_t)0x00000008)) >> 3;
    *dpllvcospeedupen = (localVal & ((uint32_t)0x00000004)) >> 2;
    *dpllfracten = (localVal & ((uint32_t)0x00000002)) >> 1;
    *dplldtpen = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t rpl_dpll_sdorder_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00030000)) >> 16);
}

__INLINE void rpl_dpll_sdorder_setf(uint8_t dpllsdorder)
{
    ASSERT_ERR((((uint32_t)dpllsdorder << 16) & ~((uint32_t)0x00030000)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL2_ADDR, (REG_RPL_RD(RPL_DPLLCNTL2_ADDR) & ~((uint32_t)0x00030000)) | ((uint32_t)dpllsdorder << 16));
}

__INLINE uint8_t rpl_dpll_icp_offset_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00007000)) >> 12);
}

__INLINE void rpl_dpll_icp_offset_setf(uint8_t dpllicpoffset)
{
    ASSERT_ERR((((uint32_t)dpllicpoffset << 12) & ~((uint32_t)0x00007000)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL2_ADDR, (REG_RPL_RD(RPL_DPLLCNTL2_ADDR) & ~((uint32_t)0x00007000)) | ((uint32_t)dpllicpoffset << 12));
}

__INLINE uint8_t rpl_dpll_vcommon_cfg_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00000800)) >> 11);
}

__INLINE void rpl_dpll_vcommon_cfg_setf(uint8_t dpllvcocfg)
{
    ASSERT_ERR((((uint32_t)dpllvcocfg << 11) & ~((uint32_t)0x00000800)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL2_ADDR, (REG_RPL_RD(RPL_DPLLCNTL2_ADDR) & ~((uint32_t)0x00000800)) | ((uint32_t)dpllvcocfg << 11));
}

__INLINE uint8_t rpl_dpll_pfd_cfg_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00000700)) >> 8);
}

__INLINE void rpl_dpll_pfd_cfg_setf(uint8_t dpllpfdcfg)
{
    ASSERT_ERR((((uint32_t)dpllpfdcfg << 8) & ~((uint32_t)0x00000700)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL2_ADDR, (REG_RPL_RD(RPL_DPLLCNTL2_ADDR) & ~((uint32_t)0x00000700)) | ((uint32_t)dpllpfdcfg << 8));
}

__INLINE uint8_t rpl_dpll_icp_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x000000F0)) >> 4);
}

__INLINE void rpl_dpll_icp_setf(uint8_t dpllicp)
{
    ASSERT_ERR((((uint32_t)dpllicp << 4) & ~((uint32_t)0x000000F0)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL2_ADDR, (REG_RPL_RD(RPL_DPLLCNTL2_ADDR) & ~((uint32_t)0x000000F0)) | ((uint32_t)dpllicp << 4));
}

__INLINE uint8_t rpl_dpll_test_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__INLINE void rpl_dpll_test_en_setf(uint8_t dplltesten)
{
    ASSERT_ERR((((uint32_t)dplltesten << 3) & ~((uint32_t)0x00000008)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL2_ADDR, (REG_RPL_RD(RPL_DPLLCNTL2_ADDR) & ~((uint32_t)0x00000008)) | ((uint32_t)dplltesten << 3));
}

