l1d000/AliOS-Things/platform/mcu/bk7231u/beken/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_ripple.h
__INLINE uint8_t rpl_dpll_ld_edges_comb_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x000C0000)) >> 18);
}

__INLINE void rpl_dpll_ld_edges_comb_setf(uint8_t dpllldedgescomb)
{
    ASSERT_ERR((((uint32_t)dpllldedgescomb << 18) & ~((uint32_t)0x000C0000)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL3_ADDR, (REG_RPL_RD(RPL_DPLLCNTL3_ADDR) & ~((uint32_t)0x000C0000)) | ((uint32_t)dpllldedgescomb << 18));
}

__INLINE uint8_t rpl_dpll_ld_fe_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x00020000)) >> 17);
}

__INLINE void rpl_dpll_ld_fe_setf(uint8_t dpllldfe)
{
    ASSERT_ERR((((uint32_t)dpllldfe << 17) & ~((uint32_t)0x00020000)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL3_ADDR, (REG_RPL_RD(RPL_DPLLCNTL3_ADDR) & ~((uint32_t)0x00020000)) | ((uint32_t)dpllldfe << 17));
}

__INLINE uint8_t rpl_dpll_ld_re_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x00010000)) >> 16);
}

__INLINE void rpl_dpll_ld_re_setf(uint8_t dpllldre)
{
    ASSERT_ERR((((uint32_t)dpllldre << 16) & ~((uint32_t)0x00010000)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL3_ADDR, (REG_RPL_RD(RPL_DPLLCNTL3_ADDR) & ~((uint32_t)0x00010000)) | ((uint32_t)dpllldre << 16));
}

__INLINE uint8_t rpl_dpll_ld_unlock_cnt_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x0000FF00)) >> 8);
}

__INLINE void rpl_dpll_ld_unlock_cnt_setf(uint8_t dpllldunlockcnt)
{
    ASSERT_ERR((((uint32_t)dpllldunlockcnt << 8) & ~((uint32_t)0x0000FF00)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL3_ADDR, (REG_RPL_RD(RPL_DPLLCNTL3_ADDR) & ~((uint32_t)0x0000FF00)) | ((uint32_t)dpllldunlockcnt << 8));
}

__INLINE uint8_t rpl_dpll_ld_lock_cnt_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLCNTL3_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__INLINE void rpl_dpll_ld_lock_cnt_setf(uint8_t dpllldlockcnt)
{
    ASSERT_ERR((((uint32_t)dpllldlockcnt << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_RPL_WR(RPL_DPLLCNTL3_ADDR, (REG_RPL_RD(RPL_DPLLCNTL3_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)dpllldlockcnt << 0));
}

/**
 * @brief DPLLSTAT register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     01      DPLL_VCOMMON_CLK_OK   0
 *     00     DPLL_LOCK_DETECT   0
 * </pre>
 */
#define RPL_DPLLSTAT_ADDR   0x00000036
#define RPL_DPLLSTAT_OFFSET 0x00000036
#define RPL_DPLLSTAT_INDEX  0x00000036
#define RPL_DPLLSTAT_RESET  0x00000000

__INLINE uint32_t rpl_dpllstat_get(void)
{
    return REG_RPL_RD(RPL_DPLLSTAT_ADDR);
}

// field definitions
#define RPL_DPLL_VCOMMON_CLK_OK_BIT     ((uint32_t)0x00000002)
#define RPL_DPLL_VCOMMON_CLK_OK_POS     1
#define RPL_DPLL_LOCK_DETECT_BIT    ((uint32_t)0x00000001)
#define RPL_DPLL_LOCK_DETECT_POS    0

#define RPL_DPLL_VCOMMON_CLK_OK_RST     0x0
#define RPL_DPLL_LOCK_DETECT_RST    0x0

__INLINE void rpl_dpllstat_unpack(uint8_t* dpllvcoclkok, uint8_t* dplllockdetect)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLSTAT_ADDR);

    *dpllvcoclkok = (localVal & ((uint32_t)0x00000002)) >> 1;
    *dplllockdetect = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t rpl_dpll_vcommon_clk_ok_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE uint8_t rpl_dpll_lock_detect_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_DPLLSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

/**
 * @brief RC_CALIB_CNTL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:28          FILT_RC_VAL   0x0
 *  27:24          RPLL_RC_VAL   0x0
 *  21:16          DPLL_RC_VAL   0x0
 *     11    FILT_RCCAL_CLK_EN   0
 *     10    RPLL_RCCAL_CLK_EN   0
 *     09    DPLL_RCCAL_CLK_EN   0
 *     08      FILT_RCCAL_NOSC   0
 *     07      RPLL_RCCAL_NOSC   0
 *     06      DPLL_RCCAL_NOSC   0
 *     02        FILT_RCCAL_ON   0
 *     01        RPLL_RCCAL_ON   0
 *     00        DPLL_RCCAL_ON   0
 * </pre>
 */
#define RPL_RC_CALIB_CNTL_ADDR   0x00000037
#define RPL_RC_CALIB_CNTL_OFFSET 0x00000037
#define RPL_RC_CALIB_CNTL_INDEX  0x00000037
#define RPL_RC_CALIB_CNTL_RESET  0x00000000

__INLINE uint32_t rpl_rc_calib_cntl_get(void)
{
    return REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR);
}

__INLINE void rpl_rc_calib_cntl_set(uint32_t value)
{
    REG_RPL_WR(RPL_RC_CALIB_CNTL_ADDR, value);
}

// field definitions
#define RPL_FILT_RC_VAL_MASK         ((uint32_t)0xF0000000)
#define RPL_FILT_RC_VAL_LSB          28
#define RPL_FILT_RC_VAL_WIDTH        ((uint32_t)0x00000004)
#define RPL_RPLL_RC_VAL_MASK         ((uint32_t)0x0F000000)
#define RPL_RPLL_RC_VAL_LSB          24
#define RPL_RPLL_RC_VAL_WIDTH        ((uint32_t)0x00000004)
#define RPL_DPLL_RC_VAL_MASK         ((uint32_t)0x003F0000)
#define RPL_DPLL_RC_VAL_LSB          16
#define RPL_DPLL_RC_VAL_WIDTH        ((uint32_t)0x00000006)
#define RPL_FILT_RCCAL_CLK_EN_BIT    ((uint32_t)0x00000800)
#define RPL_FILT_RCCAL_CLK_EN_POS    11
#define RPL_RPLL_RCCAL_CLK_EN_BIT    ((uint32_t)0x00000400)
#define RPL_RPLL_RCCAL_CLK_EN_POS    10
#define RPL_DPLL_RCCAL_CLK_EN_BIT    ((uint32_t)0x00000200)
#define RPL_DPLL_RCCAL_CLK_EN_POS    9
#define RPL_FILT_RCCAL_NOSC_BIT      ((uint32_t)0x00000100)
#define RPL_FILT_RCCAL_NOSC_POS      8
#define RPL_RPLL_RCCAL_NOSC_BIT      ((uint32_t)0x00000080)
#define RPL_RPLL_RCCAL_NOSC_POS      7
#define RPL_DPLL_RCCAL_NOSC_BIT      ((uint32_t)0x00000040)
#define RPL_DPLL_RCCAL_NOSC_POS      6
#define RPL_FILT_RCCAL_ON_BIT        ((uint32_t)0x00000004)
#define RPL_FILT_RCCAL_ON_POS        2
#define RPL_RPLL_RCCAL_ON_BIT        ((uint32_t)0x00000002)
#define RPL_RPLL_RCCAL_ON_POS        1
#define RPL_DPLL_RCCAL_ON_BIT        ((uint32_t)0x00000001)
#define RPL_DPLL_RCCAL_ON_POS        0

#define RPL_FILT_RC_VAL_RST          0x0
#define RPL_RPLL_RC_VAL_RST          0x0
#define RPL_DPLL_RC_VAL_RST          0x0
#define RPL_FILT_RCCAL_CLK_EN_RST    0x0
#define RPL_RPLL_RCCAL_CLK_EN_RST    0x0
#define RPL_DPLL_RCCAL_CLK_EN_RST    0x0
#define RPL_FILT_RCCAL_NOSC_RST      0x0
#define RPL_RPLL_RCCAL_NOSC_RST      0x0
#define RPL_DPLL_RCCAL_NOSC_RST      0x0
#define RPL_FILT_RCCAL_ON_RST        0x0
#define RPL_RPLL_RCCAL_ON_RST        0x0
#define RPL_DPLL_RCCAL_ON_RST        0x0

__INLINE void rpl_rc_calib_cntl_pack(uint8_t filtrcval, uint8_t rpllrcval, uint8_t dpllrcval, uint8_t filtrccalclken, uint8_t rpllrccalclken, uint8_t dpllrccalclken, uint8_t filtrccalnosc, uint8_t rpllrccalnosc, uint8_t dpllrccalnosc, uint8_t filtrccalon, uint8_t rpllrccalon, uint8_t dpllrccalon)
{
    ASSERT_ERR((((uint32_t)filtrcval << 28) & ~((uint32_t)0xF0000000)) == 0);
    ASSERT_ERR((((uint32_t)rpllrcval << 24) & ~((uint32_t)0x0F000000)) == 0);
    ASSERT_ERR((((uint32_t)dpllrcval << 16) & ~((uint32_t)0x003F0000)) == 0);
    ASSERT_ERR((((uint32_t)filtrccalclken << 11) & ~((uint32_t)0x00000800)) == 0);
    ASSERT_ERR((((uint32_t)rpllrccalclken << 10) & ~((uint32_t)0x00000400)) == 0);
    ASSERT_ERR((((uint32_t)dpllrccalclken << 9) & ~((uint32_t)0x00000200)) == 0);
    ASSERT_ERR((((uint32_t)filtrccalnosc << 8) & ~((uint32_t)0x00000100)) == 0);
    ASSERT_ERR((((uint32_t)rpllrccalnosc << 7) & ~((uint32_t)0x00000080)) == 0);
    ASSERT_ERR((((uint32_t)dpllrccalnosc << 6) & ~((uint32_t)0x00000040)) == 0);
    ASSERT_ERR((((uint32_t)filtrccalon << 2) & ~((uint32_t)0x00000004)) == 0);
    ASSERT_ERR((((uint32_t)rpllrccalon << 1) & ~((uint32_t)0x00000002)) == 0);
    ASSERT_ERR((((uint32_t)dpllrccalon << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(RPL_RC_CALIB_CNTL_ADDR,  ((uint32_t)filtrcval << 28) | ((uint32_t)rpllrcval << 24) | ((uint32_t)dpllrcval << 16) | ((uint32_t)filtrccalclken << 11) | ((uint32_t)rpllrccalclken << 10) | ((uint32_t)dpllrccalclken << 9) | ((uint32_t)filtrccalnosc << 8) | ((uint32_t)rpllrccalnosc << 7) | ((uint32_t)dpllrccalnosc << 6) | ((uint32_t)filtrccalon << 2) | ((uint32_t)rpllrccalon << 1) | ((uint32_t)dpllrccalon << 0));
}

__INLINE void rpl_rc_calib_cntl_unpack(uint8_t* filtrcval, uint8_t* rpllrcval, uint8_t* dpllrcval, uint8_t* filtrccalclken, uint8_t* rpllrccalclken, uint8_t* dpllrccalclken, uint8_t* filtrccalnosc, uint8_t* rpllrccalnosc, uint8_t* dpllrccalnosc, uint8_t* filtrccalon, uint8_t* rpllrccalon, uint8_t* dpllrccalon)
{
    uint32_t localVal = REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR);

    *filtrcval = (localVal & ((uint32_t)0xF0000000)) >> 28;
    *rpllrcval = (localVal & ((uint32_t)0x0F000000)) >> 24;
    *dpllrcval = (localVal & ((uint32_t)0x003F0000)) >> 16;
    *filtrccalclken = (localVal & ((uint32_t)0x00000800)) >> 11;
    *rpllrccalclken = (localVal & ((uint32_t)0x00000400)) >> 10;
    *dpllrccalclken = (localVal & ((uint32_t)0x00000200)) >> 9;
    *filtrccalnosc = (localVal & ((uint32_t)0x00000100)) >> 8;
    *rpllrccalnosc = (localVal & ((uint32_t)0x00000080)) >> 7;
    *dpllrccalnosc = (localVal & ((uint32_t)0x00000040)) >> 6;
    *filtrccalon = (localVal & ((uint32_t)0x00000004)) >> 2;
    *rpllrccalon = (localVal & ((uint32_t)0x00000002)) >> 1;
    *dpllrccalon = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t rpl_filt_rc_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR);
    return ((localVal & ((uint32_t)0xF0000000)) >> 28);
}

__INLINE void rpl_filt_rc_val_setf(uint8_t filtrcval)
{
    ASSERT_ERR((((uint32_t)filtrcval << 28) & ~((uint32_t)0xF0000000)) == 0);
    REG_RPL_WR(RPL_RC_CALIB_CNTL_ADDR, (REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR) & ~((uint32_t)0xF0000000)) | ((uint32_t)filtrcval << 28));
}

__INLINE uint8_t rpl_rpll_rc_val_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR);
    return ((localVal & ((uint32_t)0x0F000000)) >> 24);
}

__INLINE void rpl_rpll_rc_val_setf(uint8_t rpllrcval)
{
    ASSERT_ERR((((uint32_t)rpllrcval << 24) & ~((uint32_t)0x0F000000)) == 0);
    REG_RPL_WR(RPL_RC_CALIB_CNTL_ADDR, (REG_RPL_RD(RPL_RC_CALIB_CNTL_ADDR) & ~((uint32_t)0x0F000000)) | ((uint32_t)rpllrcval << 24));
}

