l1d000/AliOS-Things/platform/mcu/bk7231u/beken/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_ripple.h
__INLINE void rpl_rftx_gfsk_gain_table_set(int reg_idx, uint32_t value)
{
    ASSERT_ERR(reg_idx <= 15);
    REG_RPL_WR(RPL_RFTX_GFSK_GAIN_TABLE_ADDR + reg_idx * 1, value);
}

// field definitions
#define RPL_TX_GFSK_PAINT_GAIN_MASK    ((uint32_t)0x00000700)
#define RPL_TX_GFSK_PAINT_GAIN_LSB     8
#define RPL_TX_GFSK_PAINT_GAIN_WIDTH   ((uint32_t)0x00000003)
#define RPL_TX_GFSK_DRV_GAIN_MASK      ((uint32_t)0x00000070)
#define RPL_TX_GFSK_DRV_GAIN_LSB       4
#define RPL_TX_GFSK_DRV_GAIN_WIDTH     ((uint32_t)0x00000003)
#define RPL_TX_GFSK_FILTER_GAIN_MASK   ((uint32_t)0x00000007)
#define RPL_TX_GFSK_FILTER_GAIN_LSB    0
#define RPL_TX_GFSK_FILTER_GAIN_WIDTH  ((uint32_t)0x00000003)

#define RPL_TX_GFSK_PAINT_GAIN_RST     0x0
#define RPL_TX_GFSK_DRV_GAIN_RST       0x1
#define RPL_TX_GFSK_FILTER_GAIN_RST    0x3

__INLINE void rpl_rftx_gfsk_gain_table_pack(int reg_idx, uint8_t txgfskpaintgain, uint8_t txgfskdrvgain, uint8_t txgfskfiltergain)
{
    ASSERT_ERR(reg_idx <= 15);
    ASSERT_ERR((((uint32_t)txgfskpaintgain << 8) & ~((uint32_t)0x00000700)) == 0);
    ASSERT_ERR((((uint32_t)txgfskdrvgain << 4) & ~((uint32_t)0x00000070)) == 0);
    ASSERT_ERR((((uint32_t)txgfskfiltergain << 0) & ~((uint32_t)0x00000007)) == 0);
    REG_RPL_WR(RPL_RFTX_GFSK_GAIN_TABLE_ADDR + reg_idx * 1,  ((uint32_t)txgfskpaintgain << 8) | ((uint32_t)txgfskdrvgain << 4) | ((uint32_t)txgfskfiltergain << 0));
}

__INLINE void rpl_rftx_gfsk_gain_table_unpack(int reg_idx, uint8_t* txgfskpaintgain, uint8_t* txgfskdrvgain, uint8_t* txgfskfiltergain)
{
    ASSERT_ERR(reg_idx <= 15);
    uint32_t localVal = REG_RPL_RD(RPL_RFTX_GFSK_GAIN_TABLE_ADDR + reg_idx * 1);

    *txgfskpaintgain = (localVal & ((uint32_t)0x00000700)) >> 8;
    *txgfskdrvgain = (localVal & ((uint32_t)0x00000070)) >> 4;
    *txgfskfiltergain = (localVal & ((uint32_t)0x00000007)) >> 0;
}

__INLINE uint8_t rpl_tx_gfsk_paint_gain_getf(int reg_idx)
{
    ASSERT_ERR(reg_idx <= 15);
    uint32_t localVal = REG_RPL_RD(RPL_RFTX_GFSK_GAIN_TABLE_ADDR + reg_idx * 1);
    return ((localVal & ((uint32_t)0x00000700)) >> 8);
}

__INLINE void rpl_tx_gfsk_paint_gain_setf(int reg_idx, uint8_t txgfskpaintgain)
{
    ASSERT_ERR(reg_idx <= 15);
    ASSERT_ERR((((uint32_t)txgfskpaintgain << 8) & ~((uint32_t)0x00000700)) == 0);
    REG_RPL_WR(RPL_RFTX_GFSK_GAIN_TABLE_ADDR + reg_idx * 1, (REG_RPL_RD(RPL_RFTX_GFSK_GAIN_TABLE_ADDR + reg_idx * 1) & ~((uint32_t)0x00000700)) | ((uint32_t)txgfskpaintgain << 8));
}

__INLINE uint8_t rpl_tx_gfsk_drv_gain_getf(int reg_idx)
{
    ASSERT_ERR(reg_idx <= 15);
    uint32_t localVal = REG_RPL_RD(RPL_RFTX_GFSK_GAIN_TABLE_ADDR + reg_idx * 1);
    return ((localVal & ((uint32_t)0x00000070)) >> 4);
}

__INLINE void rpl_tx_gfsk_drv_gain_setf(int reg_idx, uint8_t txgfskdrvgain)
{
    ASSERT_ERR(reg_idx <= 15);
    ASSERT_ERR((((uint32_t)txgfskdrvgain << 4) & ~((uint32_t)0x00000070)) == 0);
    REG_RPL_WR(RPL_RFTX_GFSK_GAIN_TABLE_ADDR + reg_idx * 1, (REG_RPL_RD(RPL_RFTX_GFSK_GAIN_TABLE_ADDR + reg_idx * 1) & ~((uint32_t)0x00000070)) | ((uint32_t)txgfskdrvgain << 4));
}

__INLINE uint8_t rpl_tx_gfsk_filter_gain_getf(int reg_idx)
{
    ASSERT_ERR(reg_idx <= 15);
    uint32_t localVal = REG_RPL_RD(RPL_RFTX_GFSK_GAIN_TABLE_ADDR + reg_idx * 1);
    return ((localVal & ((uint32_t)0x00000007)) >> 0);
}

__INLINE void rpl_tx_gfsk_filter_gain_setf(int reg_idx, uint8_t txgfskfiltergain)
{
    ASSERT_ERR(reg_idx <= 15);
    ASSERT_ERR((((uint32_t)txgfskfiltergain << 0) & ~((uint32_t)0x00000007)) == 0);
    REG_RPL_WR(RPL_RFTX_GFSK_GAIN_TABLE_ADDR + reg_idx * 1, (REG_RPL_RD(RPL_RFTX_GFSK_GAIN_TABLE_ADDR + reg_idx * 1) & ~((uint32_t)0x00000007)) | ((uint32_t)txgfskfiltergain << 0));
}

/**
 * @brief RFTX_EDR_GAIN_TABLE register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  22:20   TX_DQPSK_PAINT_GAIN   0x0
 *  18:16    TX_DQPSK_DRV_GAIN   0x1
 *  14:12   TX_DQPSK_FILTER_GAIN   0x3
 *  10:08   TX_8DPSK_PAINT_GAIN   0x0
 *  06:04    TX_8DPSK_DRV_GAIN   0x1
 *  02:00   TX_8DPSK_FILTER_GAIN   0x3
 * </pre>
 */
#define RPL_RFTX_EDR_GAIN_TABLE_ADDR   0x0000005A
#define RPL_RFTX_EDR_GAIN_TABLE_OFFSET 0x0000005A
#define RPL_RFTX_EDR_GAIN_TABLE_INDEX  0x0000005A
#define RPL_RFTX_EDR_GAIN_TABLE_RESET  0x00013013
#define RPL_RFTX_EDR_GAIN_TABLE_COUNT  16

__INLINE uint32_t rpl_rftx_edr_gain_table_get(int reg_idx)
{
    ASSERT_ERR(reg_idx <= 15);
    return REG_RPL_RD(RPL_RFTX_EDR_GAIN_TABLE_ADDR + reg_idx * 1);
}

__INLINE void rpl_rftx_edr_gain_table_set(int reg_idx, uint32_t value)
{
    ASSERT_ERR(reg_idx <= 15);
    REG_RPL_WR(RPL_RFTX_EDR_GAIN_TABLE_ADDR + reg_idx * 1, value);
}

// field definitions
#define RPL_TX_DQPSK_PAINT_GAIN_MASK    ((uint32_t)0x00700000)
#define RPL_TX_DQPSK_PAINT_GAIN_LSB     20
#define RPL_TX_DQPSK_PAINT_GAIN_WIDTH   ((uint32_t)0x00000003)
#define RPL_TX_DQPSK_DRV_GAIN_MASK      ((uint32_t)0x00070000)
#define RPL_TX_DQPSK_DRV_GAIN_LSB       16
#define RPL_TX_DQPSK_DRV_GAIN_WIDTH     ((uint32_t)0x00000003)
#define RPL_TX_DQPSK_FILTER_GAIN_MASK   ((uint32_t)0x00007000)
#define RPL_TX_DQPSK_FILTER_GAIN_LSB    12
#define RPL_TX_DQPSK_FILTER_GAIN_WIDTH  ((uint32_t)0x00000003)
#define RPL_TX_8DPSK_PAINT_GAIN_MASK    ((uint32_t)0x00000700)
#define RPL_TX_8DPSK_PAINT_GAIN_LSB     8
#define RPL_TX_8DPSK_PAINT_GAIN_WIDTH   ((uint32_t)0x00000003)
#define RPL_TX_8DPSK_DRV_GAIN_MASK      ((uint32_t)0x00000070)
#define RPL_TX_8DPSK_DRV_GAIN_LSB       4
#define RPL_TX_8DPSK_DRV_GAIN_WIDTH     ((uint32_t)0x00000003)
#define RPL_TX_8DPSK_FILTER_GAIN_MASK   ((uint32_t)0x00000007)
#define RPL_TX_8DPSK_FILTER_GAIN_LSB    0
#define RPL_TX_8DPSK_FILTER_GAIN_WIDTH  ((uint32_t)0x00000003)

#define RPL_TX_DQPSK_PAINT_GAIN_RST     0x0
#define RPL_TX_DQPSK_DRV_GAIN_RST       0x1
#define RPL_TX_DQPSK_FILTER_GAIN_RST    0x3
#define RPL_TX_8DPSK_PAINT_GAIN_RST     0x0
#define RPL_TX_8DPSK_DRV_GAIN_RST       0x1
#define RPL_TX_8DPSK_FILTER_GAIN_RST    0x3

__INLINE void rpl_rftx_edr_gain_table_pack(int reg_idx, uint8_t txdqpskpaintgain, uint8_t txdqpskdrvgain, uint8_t txdqpskfiltergain, uint8_t tx8dpskpaintgain, uint8_t tx8dpskdrvgain, uint8_t tx8dpskfiltergain)
{
    ASSERT_ERR(reg_idx <= 15);
    ASSERT_ERR((((uint32_t)txdqpskpaintgain << 20) & ~((uint32_t)0x00700000)) == 0);
    ASSERT_ERR((((uint32_t)txdqpskdrvgain << 16) & ~((uint32_t)0x00070000)) == 0);
    ASSERT_ERR((((uint32_t)txdqpskfiltergain << 12) & ~((uint32_t)0x00007000)) == 0);
    ASSERT_ERR((((uint32_t)tx8dpskpaintgain << 8) & ~((uint32_t)0x00000700)) == 0);
    ASSERT_ERR((((uint32_t)tx8dpskdrvgain << 4) & ~((uint32_t)0x00000070)) == 0);
    ASSERT_ERR((((uint32_t)tx8dpskfiltergain << 0) & ~((uint32_t)0x00000007)) == 0);
    REG_RPL_WR(RPL_RFTX_EDR_GAIN_TABLE_ADDR + reg_idx * 1,  ((uint32_t)txdqpskpaintgain << 20) | ((uint32_t)txdqpskdrvgain << 16) | ((uint32_t)txdqpskfiltergain << 12) | ((uint32_t)tx8dpskpaintgain << 8) | ((uint32_t)tx8dpskdrvgain << 4) | ((uint32_t)tx8dpskfiltergain << 0));
}

__INLINE void rpl_rftx_edr_gain_table_unpack(int reg_idx, uint8_t* txdqpskpaintgain, uint8_t* txdqpskdrvgain, uint8_t* txdqpskfiltergain, uint8_t* tx8dpskpaintgain, uint8_t* tx8dpskdrvgain, uint8_t* tx8dpskfiltergain)
{
    ASSERT_ERR(reg_idx <= 15);
    uint32_t localVal = REG_RPL_RD(RPL_RFTX_EDR_GAIN_TABLE_ADDR + reg_idx * 1);

    *txdqpskpaintgain = (localVal & ((uint32_t)0x00700000)) >> 20;
    *txdqpskdrvgain = (localVal & ((uint32_t)0x00070000)) >> 16;
    *txdqpskfiltergain = (localVal & ((uint32_t)0x00007000)) >> 12;
    *tx8dpskpaintgain = (localVal & ((uint32_t)0x00000700)) >> 8;
    *tx8dpskdrvgain = (localVal & ((uint32_t)0x00000070)) >> 4;
    *tx8dpskfiltergain = (localVal & ((uint32_t)0x00000007)) >> 0;
}

__INLINE uint8_t rpl_tx_dqpsk_paint_gain_getf(int reg_idx)
{
    ASSERT_ERR(reg_idx <= 15);
    uint32_t localVal = REG_RPL_RD(RPL_RFTX_EDR_GAIN_TABLE_ADDR + reg_idx * 1);
    return ((localVal & ((uint32_t)0x00700000)) >> 20);
}

__INLINE void rpl_tx_dqpsk_paint_gain_setf(int reg_idx, uint8_t txdqpskpaintgain)
{
    ASSERT_ERR(reg_idx <= 15);
    ASSERT_ERR((((uint32_t)txdqpskpaintgain << 20) & ~((uint32_t)0x00700000)) == 0);
    REG_RPL_WR(RPL_RFTX_EDR_GAIN_TABLE_ADDR + reg_idx * 1, (REG_RPL_RD(RPL_RFTX_EDR_GAIN_TABLE_ADDR + reg_idx * 1) & ~((uint32_t)0x00700000)) | ((uint32_t)txdqpskpaintgain << 20));
}

__INLINE uint8_t rpl_tx_dqpsk_drv_gain_getf(int reg_idx)
{
    ASSERT_ERR(reg_idx <= 15);
    uint32_t localVal = REG_RPL_RD(RPL_RFTX_EDR_GAIN_TABLE_ADDR + reg_idx * 1);
    return ((localVal & ((uint32_t)0x00070000)) >> 16);
}

