l1d000/AliOS-Things/platform/mcu/bk7231u/beken/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_ripple.h
__INLINE uint8_t rpl_sd_clk_gate_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__INLINE void rpl_sd_clk_gate_en_setf(uint8_t sdclkgateen)
{
    ASSERT_ERR((((uint32_t)sdclkgateen << 3) & ~((uint32_t)0x00000008)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x00000008)) | ((uint32_t)sdclkgateen << 3));
}

__INLINE uint8_t rpl_gfsk_prefilt_clk_gate_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__INLINE void rpl_gfsk_prefilt_clk_gate_en_setf(uint8_t gfskprefiltclkgateen)
{
    ASSERT_ERR((((uint32_t)gfskprefiltclkgateen << 2) & ~((uint32_t)0x00000004)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x00000004)) | ((uint32_t)gfskprefiltclkgateen << 2));
}

__INLINE uint8_t rpl_dap_calib_clk_gate_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000002)) >> 1);
}

__INLINE void rpl_dap_calib_clk_gate_en_setf(uint8_t dapcalibclkgateen)
{
    ASSERT_ERR((((uint32_t)dapcalibclkgateen << 1) & ~((uint32_t)0x00000002)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x00000002)) | ((uint32_t)dapcalibclkgateen << 1));
}

__INLINE uint8_t rpl_dap_clk_gate_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00000001)) >> 0);
}

__INLINE void rpl_dap_clk_gate_en_setf(uint8_t dapclkgateen)
{
    ASSERT_ERR((((uint32_t)dapclkgateen << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL0_ADDR, (REG_RPL_RD(RPL_CRM_CNTL0_ADDR) & ~((uint32_t)0x00000001)) | ((uint32_t)dapclkgateen << 0));
}

/**
 * @brief CRM_CNTL1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31       FORCE_CRM_CTRL   0
 *  25:24      CLK_SWITCH_CTRL   0x0
 *     23              DPLL_EN   0
 *     12      SAR_ADC_CLK_SEL   0
 *  09:08           BB_CLK_DIV   0x2
 *     00              LP_MODE   0
 * </pre>
 */
#define RPL_CRM_CNTL1_ADDR   0x0000006C
#define RPL_CRM_CNTL1_OFFSET 0x0000006C
#define RPL_CRM_CNTL1_INDEX  0x0000006C
#define RPL_CRM_CNTL1_RESET  0x00000200

__INLINE uint32_t rpl_crm_cntl1_get(void)
{
    return REG_RPL_RD(RPL_CRM_CNTL1_ADDR);
}

__INLINE void rpl_crm_cntl1_set(uint32_t value)
{
    REG_RPL_WR(RPL_CRM_CNTL1_ADDR, value);
}

// field definitions
#define RPL_FORCE_CRM_CTRL_BIT     ((uint32_t)0x80000000)
#define RPL_FORCE_CRM_CTRL_POS     31
#define RPL_CLK_SWITCH_CTRL_MASK   ((uint32_t)0x03000000)
#define RPL_CLK_SWITCH_CTRL_LSB    24
#define RPL_CLK_SWITCH_CTRL_WIDTH  ((uint32_t)0x00000002)
#define RPL_DPLL_EN_BIT            ((uint32_t)0x00800000)
#define RPL_DPLL_EN_POS            23
#define RPL_SAR_ADC_CLK_SEL_BIT    ((uint32_t)0x00001000)
#define RPL_SAR_ADC_CLK_SEL_POS    12
#define RPL_BB_CLK_DIV_MASK        ((uint32_t)0x00000300)
#define RPL_BB_CLK_DIV_LSB         8
#define RPL_BB_CLK_DIV_WIDTH       ((uint32_t)0x00000002)
#define RPL_LP_MODE_BIT            ((uint32_t)0x00000001)
#define RPL_LP_MODE_POS            0

#define RPL_FORCE_CRM_CTRL_RST     0x0
#define RPL_CLK_SWITCH_CTRL_RST    0x0
#define RPL_DPLL_EN_RST            0x0
#define RPL_SAR_ADC_CLK_SEL_RST    0x0
#define RPL_BB_CLK_DIV_RST         0x2
#define RPL_LP_MODE_RST            0x0

__INLINE void rpl_crm_cntl1_pack(uint8_t forcecrmctrl, uint8_t clkswitchctrl, uint8_t dpllen, uint8_t saradcclksel, uint8_t bbclkdiv, uint8_t lpmode)
{
    ASSERT_ERR((((uint32_t)forcecrmctrl << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)clkswitchctrl << 24) & ~((uint32_t)0x03000000)) == 0);
    ASSERT_ERR((((uint32_t)dpllen << 23) & ~((uint32_t)0x00800000)) == 0);
    ASSERT_ERR((((uint32_t)saradcclksel << 12) & ~((uint32_t)0x00001000)) == 0);
    ASSERT_ERR((((uint32_t)bbclkdiv << 8) & ~((uint32_t)0x00000300)) == 0);
    ASSERT_ERR((((uint32_t)lpmode << 0) & ~((uint32_t)0x00000001)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL1_ADDR,  ((uint32_t)forcecrmctrl << 31) | ((uint32_t)clkswitchctrl << 24) | ((uint32_t)dpllen << 23) | ((uint32_t)saradcclksel << 12) | ((uint32_t)bbclkdiv << 8) | ((uint32_t)lpmode << 0));
}

__INLINE void rpl_crm_cntl1_unpack(uint8_t* forcecrmctrl, uint8_t* clkswitchctrl, uint8_t* dpllen, uint8_t* saradcclksel, uint8_t* bbclkdiv, uint8_t* lpmode)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL1_ADDR);

    *forcecrmctrl = (localVal & ((uint32_t)0x80000000)) >> 31;
    *clkswitchctrl = (localVal & ((uint32_t)0x03000000)) >> 24;
    *dpllen = (localVal & ((uint32_t)0x00800000)) >> 23;
    *saradcclksel = (localVal & ((uint32_t)0x00001000)) >> 12;
    *bbclkdiv = (localVal & ((uint32_t)0x00000300)) >> 8;
    *lpmode = (localVal & ((uint32_t)0x00000001)) >> 0;
}

__INLINE uint8_t rpl_force_crm_ctrl_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL1_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__INLINE void rpl_force_crm_ctrl_setf(uint8_t forcecrmctrl)
{
    ASSERT_ERR((((uint32_t)forcecrmctrl << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL1_ADDR, (REG_RPL_RD(RPL_CRM_CNTL1_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)forcecrmctrl << 31));
}

__INLINE uint8_t rpl_clk_switch_ctrl_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL1_ADDR);
    return ((localVal & ((uint32_t)0x03000000)) >> 24);
}

__INLINE void rpl_clk_switch_ctrl_setf(uint8_t clkswitchctrl)
{
    ASSERT_ERR((((uint32_t)clkswitchctrl << 24) & ~((uint32_t)0x03000000)) == 0);
    REG_RPL_WR(RPL_CRM_CNTL1_ADDR, (REG_RPL_RD(RPL_CRM_CNTL1_ADDR) & ~((uint32_t)0x03000000)) | ((uint32_t)clkswitchctrl << 24));
}

__INLINE uint8_t rpl_dpll_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_CRM_CNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00800000)) >> 23);
}

