l1d000/AliOS-Things/platform/mcu/bk7231u/beken/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_ripple.h
__INLINE void rpl_rfrxcntl_unpack(uint8_t* rxctrlforce, uint8_t* rxgainforce, uint8_t* forceaddarst, uint8_t* rssiclkinven, uint8_t* rxadcclkinven, uint8_t* nldoaddarst, uint8_t* rxadcsatdeten, uint8_t* modemrxen, uint8_t* rxadcen, uint8_t* rxadcon, uint8_t* agcen, uint8_t* rssion, uint8_t* rxfilton, uint8_t* rxlobufon, uint8_t* rxmixon, uint8_t* rxlnaon, uint8_t* rxrfbiason, uint8_t* rxgainsel)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);

    *rxctrlforce = (localVal & ((uint32_t)0x80000000)) >> 31;
    *rxgainforce = (localVal & ((uint32_t)0x40000000)) >> 30;
    *forceaddarst = (localVal & ((uint32_t)0x20000000)) >> 29;
    *rssiclkinven = (localVal & ((uint32_t)0x02000000)) >> 25;
    *rxadcclkinven = (localVal & ((uint32_t)0x01000000)) >> 24;
    *nldoaddarst = (localVal & ((uint32_t)0x00040000)) >> 18;
    *rxadcsatdeten = (localVal & ((uint32_t)0x00002000)) >> 13;
    *modemrxen = (localVal & ((uint32_t)0x00001000)) >> 12;
    *rxadcen = (localVal & ((uint32_t)0x00000800)) >> 11;
    *rxadcon = (localVal & ((uint32_t)0x00000400)) >> 10;
    *agcen = (localVal & ((uint32_t)0x00000200)) >> 9;
    *rssion = (localVal & ((uint32_t)0x00000100)) >> 8;
    *rxfilton = (localVal & ((uint32_t)0x00000080)) >> 7;
    *rxlobufon = (localVal & ((uint32_t)0x00000040)) >> 6;
    *rxmixon = (localVal & ((uint32_t)0x00000020)) >> 5;
    *rxlnaon = (localVal & ((uint32_t)0x00000010)) >> 4;
    *rxrfbiason = (localVal & ((uint32_t)0x00000008)) >> 3;
    *rxgainsel = (localVal & ((uint32_t)0x00000007)) >> 0;
}

__INLINE uint8_t rpl_rxctrl_force_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__INLINE void rpl_rxctrl_force_setf(uint8_t rxctrlforce)
{
    ASSERT_ERR((((uint32_t)rxctrlforce << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)rxctrlforce << 31));
}

__INLINE uint8_t rpl_rxgain_force_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x40000000)) >> 30);
}

__INLINE void rpl_rxgain_force_setf(uint8_t rxgainforce)
{
    ASSERT_ERR((((uint32_t)rxgainforce << 30) & ~((uint32_t)0x40000000)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x40000000)) | ((uint32_t)rxgainforce << 30));
}

__INLINE uint8_t rpl_force_adda_rst_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x20000000)) >> 29);
}

__INLINE void rpl_force_adda_rst_setf(uint8_t forceaddarst)
{
    ASSERT_ERR((((uint32_t)forceaddarst << 29) & ~((uint32_t)0x20000000)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x20000000)) | ((uint32_t)forceaddarst << 29));
}

__INLINE uint8_t rpl_rssi_clk_inv_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x02000000)) >> 25);
}

__INLINE void rpl_rssi_clk_inv_en_setf(uint8_t rssiclkinven)
{
    ASSERT_ERR((((uint32_t)rssiclkinven << 25) & ~((uint32_t)0x02000000)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x02000000)) | ((uint32_t)rssiclkinven << 25));
}

__INLINE uint8_t rpl_rxadc_clk_inv_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x01000000)) >> 24);
}

__INLINE void rpl_rxadc_clk_inv_en_setf(uint8_t rxadcclkinven)
{
    ASSERT_ERR((((uint32_t)rxadcclkinven << 24) & ~((uint32_t)0x01000000)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x01000000)) | ((uint32_t)rxadcclkinven << 24));
}

__INLINE uint8_t rpl_n_ldo_adda_rst_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00040000)) >> 18);
}

__INLINE void rpl_n_ldo_adda_rst_setf(uint8_t nldoaddarst)
{
    ASSERT_ERR((((uint32_t)nldoaddarst << 18) & ~((uint32_t)0x00040000)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x00040000)) | ((uint32_t)nldoaddarst << 18));
}

__INLINE uint8_t rpl_rxadc_satdet_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00002000)) >> 13);
}

__INLINE void rpl_rxadc_satdet_en_setf(uint8_t rxadcsatdeten)
{
    ASSERT_ERR((((uint32_t)rxadcsatdeten << 13) & ~((uint32_t)0x00002000)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x00002000)) | ((uint32_t)rxadcsatdeten << 13));
}

__INLINE uint8_t rpl_modem_rx_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00001000)) >> 12);
}

__INLINE void rpl_modem_rx_en_setf(uint8_t modemrxen)
{
    ASSERT_ERR((((uint32_t)modemrxen << 12) & ~((uint32_t)0x00001000)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x00001000)) | ((uint32_t)modemrxen << 12));
}

__INLINE uint8_t rpl_rxadc_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000800)) >> 11);
}

__INLINE void rpl_rxadc_en_setf(uint8_t rxadcen)
{
    ASSERT_ERR((((uint32_t)rxadcen << 11) & ~((uint32_t)0x00000800)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x00000800)) | ((uint32_t)rxadcen << 11));
}

__INLINE uint8_t rpl_rxadc_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000400)) >> 10);
}

__INLINE void rpl_rxadc_on_setf(uint8_t rxadcon)
{
    ASSERT_ERR((((uint32_t)rxadcon << 10) & ~((uint32_t)0x00000400)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x00000400)) | ((uint32_t)rxadcon << 10));
}

__INLINE uint8_t rpl_agc_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000200)) >> 9);
}

__INLINE void rpl_agc_en_setf(uint8_t agcen)
{
    ASSERT_ERR((((uint32_t)agcen << 9) & ~((uint32_t)0x00000200)) == 0);
    REG_RPL_WR(RPL_RFRXCNTL_ADDR, (REG_RPL_RD(RPL_RFRXCNTL_ADDR) & ~((uint32_t)0x00000200)) | ((uint32_t)agcen << 9));
}

__INLINE uint8_t rpl_rssi_on_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFRXCNTL_ADDR);
    return ((localVal & ((uint32_t)0x00000100)) >> 8);
}

