l1d000/AliOS-Things/platform/mcu/bk7231u/beken/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_ripple.h
__INLINE void rpl_rftxcntl0_unpack(uint8_t* txctrlforce, uint8_t* txgaingfskforce, uint8_t* txgainedrforce, uint8_t* txdacclkinven, uint8_t* txdccaltimeoutdsb, uint8_t* txdccalen, uint8_t* txdccalstart, uint8_t* sdfifoen, uint8_t* rampgenen, uint8_t* modemtxen, uint8_t* fmtx2pon, uint8_t* txfiltqon, uint8_t* txfiltion, uint8_t* txdacqon, uint8_t* txdacion, uint8_t* fmtxon, uint8_t* txpaon, uint8_t* txpasel, uint8_t* txrfdetecton, uint8_t* txmixon, uint8_t* txlobufon, uint8_t* txgainedrsel, uint8_t* txgaingfsksel)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);

    *txctrlforce = (localVal & ((uint32_t)0x80000000)) >> 31;
    *txgaingfskforce = (localVal & ((uint32_t)0x40000000)) >> 30;
    *txgainedrforce = (localVal & ((uint32_t)0x20000000)) >> 29;
    *txdacclkinven = (localVal & ((uint32_t)0x08000000)) >> 27;
    *txdccaltimeoutdsb = (localVal & ((uint32_t)0x04000000)) >> 26;
    *txdccalen = (localVal & ((uint32_t)0x02000000)) >> 25;
    *txdccalstart = (localVal & ((uint32_t)0x01000000)) >> 24;
    *sdfifoen = (localVal & ((uint32_t)0x00200000)) >> 21;
    *rampgenen = (localVal & ((uint32_t)0x00100000)) >> 20;
    *modemtxen = (localVal & ((uint32_t)0x00080000)) >> 19;
    *fmtx2pon = (localVal & ((uint32_t)0x00040000)) >> 18;
    *txfiltqon = (localVal & ((uint32_t)0x00020000)) >> 17;
    *txfiltion = (localVal & ((uint32_t)0x00010000)) >> 16;
    *txdacqon = (localVal & ((uint32_t)0x00008000)) >> 15;
    *txdacion = (localVal & ((uint32_t)0x00004000)) >> 14;
    *fmtxon = (localVal & ((uint32_t)0x00002000)) >> 13;
    *txpaon = (localVal & ((uint32_t)0x00001000)) >> 12;
    *txpasel = (localVal & ((uint32_t)0x00000800)) >> 11;
    *txrfdetecton = (localVal & ((uint32_t)0x00000400)) >> 10;
    *txmixon = (localVal & ((uint32_t)0x00000200)) >> 9;
    *txlobufon = (localVal & ((uint32_t)0x00000100)) >> 8;
    *txgainedrsel = (localVal & ((uint32_t)0x000000F0)) >> 4;
    *txgaingfsksel = (localVal & ((uint32_t)0x0000000F)) >> 0;
}

__INLINE uint8_t rpl_txctrl_force_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__INLINE void rpl_txctrl_force_setf(uint8_t txctrlforce)
{
    ASSERT_ERR((((uint32_t)txctrlforce << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)txctrlforce << 31));
}

__INLINE uint8_t rpl_txgain_gfsk_force_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x40000000)) >> 30);
}

__INLINE void rpl_txgain_gfsk_force_setf(uint8_t txgaingfskforce)
{
    ASSERT_ERR((((uint32_t)txgaingfskforce << 30) & ~((uint32_t)0x40000000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x40000000)) | ((uint32_t)txgaingfskforce << 30));
}

__INLINE uint8_t rpl_txgain_edr_force_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x20000000)) >> 29);
}

__INLINE void rpl_txgain_edr_force_setf(uint8_t txgainedrforce)
{
    ASSERT_ERR((((uint32_t)txgainedrforce << 29) & ~((uint32_t)0x20000000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x20000000)) | ((uint32_t)txgainedrforce << 29));
}

__INLINE uint8_t rpl_txdac_clk_inv_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x08000000)) >> 27);
}

__INLINE void rpl_txdac_clk_inv_en_setf(uint8_t txdacclkinven)
{
    ASSERT_ERR((((uint32_t)txdacclkinven << 27) & ~((uint32_t)0x08000000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x08000000)) | ((uint32_t)txdacclkinven << 27));
}

__INLINE uint8_t rpl_txdc_cal_timeout_dsb_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x04000000)) >> 26);
}

__INLINE void rpl_txdc_cal_timeout_dsb_setf(uint8_t txdccaltimeoutdsb)
{
    ASSERT_ERR((((uint32_t)txdccaltimeoutdsb << 26) & ~((uint32_t)0x04000000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x04000000)) | ((uint32_t)txdccaltimeoutdsb << 26));
}

__INLINE uint8_t rpl_txdc_cal_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x02000000)) >> 25);
}

__INLINE void rpl_txdc_cal_en_setf(uint8_t txdccalen)
{
    ASSERT_ERR((((uint32_t)txdccalen << 25) & ~((uint32_t)0x02000000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x02000000)) | ((uint32_t)txdccalen << 25));
}

__INLINE uint8_t rpl_txdc_cal_start_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x01000000)) >> 24);
}

__INLINE void rpl_txdc_cal_start_setf(uint8_t txdccalstart)
{
    ASSERT_ERR((((uint32_t)txdccalstart << 24) & ~((uint32_t)0x01000000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x01000000)) | ((uint32_t)txdccalstart << 24));
}

__INLINE uint8_t rpl_sd_fifo_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00200000)) >> 21);
}

__INLINE void rpl_sd_fifo_en_setf(uint8_t sdfifoen)
{
    ASSERT_ERR((((uint32_t)sdfifoen << 21) & ~((uint32_t)0x00200000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x00200000)) | ((uint32_t)sdfifoen << 21));
}

__INLINE uint8_t rpl_ramp_gen_en_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXCNTL0_ADDR);
    return ((localVal & ((uint32_t)0x00100000)) >> 20);
}

__INLINE void rpl_ramp_gen_en_setf(uint8_t rampgenen)
{
    ASSERT_ERR((((uint32_t)rampgenen << 20) & ~((uint32_t)0x00100000)) == 0);
    REG_RPL_WR(RPL_RFTXCNTL0_ADDR, (REG_RPL_RD(RPL_RFTXCNTL0_ADDR) & ~((uint32_t)0x00100000)) | ((uint32_t)rampgenen << 20));
}

