l1d000/AliOS-Things/platform/mcu/bk7231u/beken/driver/ble/ble_pub/plf/refip/src/build/ble-full/reg/fw/reg_ripple.h
__INLINE void rpl_rftxrxconfig_pack(uint8_t databuspol, uint8_t icpcaldsb, uint8_t calibmode, uint8_t calibtimeoutdelay, uint8_t icpcalsettletime, uint8_t vcofccalsettletime, uint8_t bbbiascfg, uint8_t dapclkmode, uint8_t lodiv2trim, uint8_t lobuftrim)
{
    ASSERT_ERR((((uint32_t)databuspol << 31) & ~((uint32_t)0x80000000)) == 0);
    ASSERT_ERR((((uint32_t)icpcaldsb << 30) & ~((uint32_t)0x40000000)) == 0);
    ASSERT_ERR((((uint32_t)calibmode << 28) & ~((uint32_t)0x30000000)) == 0);
    ASSERT_ERR((((uint32_t)calibtimeoutdelay << 20) & ~((uint32_t)0x0FF00000)) == 0);
    ASSERT_ERR((((uint32_t)icpcalsettletime << 14) & ~((uint32_t)0x000FC000)) == 0);
    ASSERT_ERR((((uint32_t)vcofccalsettletime << 8) & ~((uint32_t)0x00003F00)) == 0);
    ASSERT_ERR((((uint32_t)bbbiascfg << 6) & ~((uint32_t)0x000000C0)) == 0);
    ASSERT_ERR((((uint32_t)dapclkmode << 4) & ~((uint32_t)0x00000010)) == 0);
    ASSERT_ERR((((uint32_t)lodiv2trim << 2) & ~((uint32_t)0x0000000C)) == 0);
    ASSERT_ERR((((uint32_t)lobuftrim << 0) & ~((uint32_t)0x00000003)) == 0);
    REG_RPL_WR(RPL_RFTXRXCONFIG_ADDR,  ((uint32_t)databuspol << 31) | ((uint32_t)icpcaldsb << 30) | ((uint32_t)calibmode << 28) | ((uint32_t)calibtimeoutdelay << 20) | ((uint32_t)icpcalsettletime << 14) | ((uint32_t)vcofccalsettletime << 8) | ((uint32_t)bbbiascfg << 6) | ((uint32_t)dapclkmode << 4) | ((uint32_t)lodiv2trim << 2) | ((uint32_t)lobuftrim << 0));
}

__INLINE void rpl_rftxrxconfig_unpack(uint8_t* databuspol, uint8_t* icpcaldsb, uint8_t* calibmode, uint8_t* calibtimeoutdelay, uint8_t* icpcalsettletime, uint8_t* vcofccalsettletime, uint8_t* bbbiascfg, uint8_t* dapclkmode, uint8_t* lodiv2trim, uint8_t* lobuftrim)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR);

    *databuspol = (localVal & ((uint32_t)0x80000000)) >> 31;
    *icpcaldsb = (localVal & ((uint32_t)0x40000000)) >> 30;
    *calibmode = (localVal & ((uint32_t)0x30000000)) >> 28;
    *calibtimeoutdelay = (localVal & ((uint32_t)0x0FF00000)) >> 20;
    *icpcalsettletime = (localVal & ((uint32_t)0x000FC000)) >> 14;
    *vcofccalsettletime = (localVal & ((uint32_t)0x00003F00)) >> 8;
    *bbbiascfg = (localVal & ((uint32_t)0x000000C0)) >> 6;
    *dapclkmode = (localVal & ((uint32_t)0x00000010)) >> 4;
    *lodiv2trim = (localVal & ((uint32_t)0x0000000C)) >> 2;
    *lobuftrim = (localVal & ((uint32_t)0x00000003)) >> 0;
}

__INLINE uint8_t rpl_data_bus_pol_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__INLINE void rpl_data_bus_pol_setf(uint8_t databuspol)
{
    ASSERT_ERR((((uint32_t)databuspol << 31) & ~((uint32_t)0x80000000)) == 0);
    REG_RPL_WR(RPL_RFTXRXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR) & ~((uint32_t)0x80000000)) | ((uint32_t)databuspol << 31));
}

__INLINE uint8_t rpl_icp_cal_dsb_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x40000000)) >> 30);
}

__INLINE void rpl_icp_cal_dsb_setf(uint8_t icpcaldsb)
{
    ASSERT_ERR((((uint32_t)icpcaldsb << 30) & ~((uint32_t)0x40000000)) == 0);
    REG_RPL_WR(RPL_RFTXRXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR) & ~((uint32_t)0x40000000)) | ((uint32_t)icpcaldsb << 30));
}

__INLINE uint8_t rpl_calib_mode_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x30000000)) >> 28);
}

__INLINE void rpl_calib_mode_setf(uint8_t calibmode)
{
    ASSERT_ERR((((uint32_t)calibmode << 28) & ~((uint32_t)0x30000000)) == 0);
    REG_RPL_WR(RPL_RFTXRXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR) & ~((uint32_t)0x30000000)) | ((uint32_t)calibmode << 28));
}

__INLINE uint8_t rpl_calib_timeout_delay_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x0FF00000)) >> 20);
}

__INLINE void rpl_calib_timeout_delay_setf(uint8_t calibtimeoutdelay)
{
    ASSERT_ERR((((uint32_t)calibtimeoutdelay << 20) & ~((uint32_t)0x0FF00000)) == 0);
    REG_RPL_WR(RPL_RFTXRXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR) & ~((uint32_t)0x0FF00000)) | ((uint32_t)calibtimeoutdelay << 20));
}

__INLINE uint8_t rpl_icp_cal_settle_time_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x000FC000)) >> 14);
}

__INLINE void rpl_icp_cal_settle_time_setf(uint8_t icpcalsettletime)
{
    ASSERT_ERR((((uint32_t)icpcalsettletime << 14) & ~((uint32_t)0x000FC000)) == 0);
    REG_RPL_WR(RPL_RFTXRXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR) & ~((uint32_t)0x000FC000)) | ((uint32_t)icpcalsettletime << 14));
}

__INLINE uint8_t rpl_vcofc_cal_settle_time_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x00003F00)) >> 8);
}

__INLINE void rpl_vcofc_cal_settle_time_setf(uint8_t vcofccalsettletime)
{
    ASSERT_ERR((((uint32_t)vcofccalsettletime << 8) & ~((uint32_t)0x00003F00)) == 0);
    REG_RPL_WR(RPL_RFTXRXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR) & ~((uint32_t)0x00003F00)) | ((uint32_t)vcofccalsettletime << 8));
}

__INLINE uint8_t rpl_bb_bias_cfg_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x000000C0)) >> 6);
}

__INLINE void rpl_bb_bias_cfg_setf(uint8_t bbbiascfg)
{
    ASSERT_ERR((((uint32_t)bbbiascfg << 6) & ~((uint32_t)0x000000C0)) == 0);
    REG_RPL_WR(RPL_RFTXRXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR) & ~((uint32_t)0x000000C0)) | ((uint32_t)bbbiascfg << 6));
}

__INLINE uint8_t rpl_dap_clk_mode_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__INLINE void rpl_dap_clk_mode_setf(uint8_t dapclkmode)
{
    ASSERT_ERR((((uint32_t)dapclkmode << 4) & ~((uint32_t)0x00000010)) == 0);
    REG_RPL_WR(RPL_RFTXRXCONFIG_ADDR, (REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR) & ~((uint32_t)0x00000010)) | ((uint32_t)dapclkmode << 4));
}

__INLINE uint8_t rpl_lodiv2_trim_getf(void)
{
    uint32_t localVal = REG_RPL_RD(RPL_RFTXRXCONFIG_ADDR);
    return ((localVal & ((uint32_t)0x0000000C)) >> 2);
}

